# Задача 14: Требуется вывести все целые степени двойки (т.е. числа вида 2k), не превосходящие числа N.

number_N = int(input('Введите число N: '))
two = 0

for i in range(number_N):
    two = 2**(i+1)
    print(f'2 ** {i + 1} = {two}')
